PisoFoam-laminar/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  p
     {
       solver          GAMG;
       tolerance       1e-06;				     relTol          0.1;
       smoother        GaussSeidel;
						          }

    pFinal
    {
        $p;
	tolerance       1e-06;
        relTol          0;
    }

        "(U|k|epsilon|omega|R|nuTilda)"
    {
     solver          smoothSolver;
     smoother        GaussSeidel;
     tolerance       1e-05;				   relTol          0;
							    }
    Phi
    {
	 solver          GAMG;
	 smoother        DIC;
	 tolerance       1e-06; 			        relTol          0.01;
							       }
        p
	 {
		  $Phi;
         }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}
//////////
//
potentialFlow
{
	    nNonOrthogonalCorrectors 3;
}




// ************************************************************************* //
